# DataFrames (Review #1) -> Includes Data Input & Ouput -> CSV, EXCEL, HTML, SQL

In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [31]:
np.random.seed(101)

In [32]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'],['W','X','Y','Z'])

In [33]:
df # Contains list of rows and columns

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
df['W'] # Return the columns

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [35]:
type(df['W'])

pandas.core.series.Series

In [36]:
df[['X', 'Z']] # Return multiple columns in DF

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
C  0.740122 -0.589001
D -0.758872  0.955057
E  1.978757  0.683509

In [55]:
df['new'] = df['W'] + df['Y']

In [56]:
df['new']

A    3.614819
B   -0.196959
C   -1.489355
D   -0.744542
E    2.796762
Name: new, dtype: float64

In [57]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [58]:
# Dropping cols -> using the inplace=True will allows the changes to stay in place.
df.drop('new', axis=1, inplace=True)

In [59]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [61]:
# Drop rows
df.drop('E', axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [64]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [65]:
df.shape

(5, 4)

In [66]:
df[['X', 'Z']]

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
C  0.740122 -0.589001
D -0.758872  0.955057
E  1.978757  0.683509

In [67]:
# Selecting Rows
df.loc['B']

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [68]:
# NOTE: Both rows and cols are series individually

In [70]:
df.iloc[2] # index location-based

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [72]:
# subsets -> Returns the result of the exact location
df.loc['B','Y']

-0.8480769834036315

In [74]:
df.loc[['A', 'B'],['W', 'Y']] # Returns rows selected and corres. cols

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

# DataFrames (Review #2)

CONDITIONAL SELECTIONS & MULTI-INDEX PARTS OF DF

In [76]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [78]:
booldf = df > 0

In [79]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [80]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [81]:
# NaN represents false and values that are present are true

In [82]:
# Common Practice
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [83]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [86]:
# Filter out
df[df['W'] > 0] # Cond. based on cols

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [88]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [89]:
# TODO: Grab all rows in DF where c is less than 0 -> Ans: Row C will be returned only.
df[df['Z'] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [95]:
# use the resulting df to find the value assoc. with col X
resultdf = df[df['Z'] < 0]
resultdf['X']

C    0.740122
Name: X, dtype: float64

In [97]:
# Single Line Statement (condensed steps into 1)
df[df['Z'] < 0]['X']

C    0.740122
Name: X, dtype: float64

In [98]:
df[df['Z'] < 0][['Y', 'X']]

          Y         X
C  0.528813  0.740122

In [103]:
# Return DF without row C given the cond.

boolSer = df['W'] > 0
result = df[boolSer]
mycols = ['Y', 'X']
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

## Handling Multiple Conditions

In [130]:
# Handle using '&' operator instead of standard python 'and' keyword, same with 'or' -> use '|'
df[(df['W'] > 0) & (df['Y'] > 1)]

   level_0 index         W         X         Y         Z
4        4     E  0.190794  1.978757  2.605967  0.683509

In [136]:
# reset method for index
# df.reset_index()

# to have the reset occur in place use the inplace=True
# df.reset_index(inplace=True)
df

   level_0 index         W         X         Y         Z
0        0     A  2.706850  0.628133  0.907969  0.503826
1        1     B  0.651118 -0.319318 -0.848077  0.605965
2        2     C -2.018168  0.740122  0.528813 -0.589001
3        3     D  0.188695 -0.758872 -0.933237  0.955057
4        4     E  0.190794  1.978757  2.605967  0.683509

In [159]:
newind = 'CA NY WY OR CO'.split()

In [160]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [165]:
df['States'] = newind

In [167]:
# df.drop('level_0', axis=1, inplace=True)
df

          W         X         Y         Z States
0  2.706850  0.628133  0.907969  0.503826     CA
1  0.651118 -0.319318 -0.848077  0.605965     NY
2 -2.018168  0.740122  0.528813 -0.589001     WY
3  0.188695 -0.758872 -0.933237  0.955057     OR
4  0.190794  1.978757  2.605967  0.683509     CO

In [170]:
df.set_index('States')
df

          W         X         Y         Z States
0  2.706850  0.628133  0.907969  0.503826     CA
1  0.651118 -0.319318 -0.848077  0.605965     NY
2 -2.018168  0.740122  0.528813 -0.589001     WY
3  0.188695 -0.758872 -0.933237  0.955057     OR
4  0.190794  1.978757  2.605967  0.683509     CO

# Data Input & Ouput -> CSV, EXCEL, HTML, SQL

Dependicies to install: 
pip3 sqlalchemy lxml html5lib BeautifulSoup4

In [175]:
import pandas as pd

In [194]:
df = pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

In [195]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

# Saving and Storing Data To Excel, and Creating Sheets/Documents

In [197]:
# Save to excel new sheet
df.to_excel('Sample_Output.xlsx', sheet_name='NewSheet')

In [202]:
# Sample Data From HTML Document -> Basically webscraping in Pandas
# https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/

In [203]:
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [204]:
data[0].head()

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Republic First Bank dba Republic Bank,Philadelphia,PA,27332,"Fulton Bank, National Association","April 26, 2024",10546
1,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
2,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
3,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
4,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540

# Working with SQL (Create and storing data within tables using Pandas)

In [208]:
# Create simple SQL engine in MEM
from sqlalchemy import create_engine

In [209]:
engine = create_engine('sqlite:///:memory:')

In [210]:
df.to_sql('my_table', engine)

4

In [213]:
sqldf = pd.read_sql('my_table', con=engine)
sqldf

   index  Unnamed: 0   a   b   c   d
0      0           0   0   1   2   3
1      1           1   4   5   6   7
2      2           2   8   9  10  11
3      3           3  12  13  14  15